{
  "allow_neg_eigval": false,
  "attn": null,
  "attn_mode": "chunk",
  "bos_token_id": 1,
  "conv_size": 4,
  "eos_token_id": 2,
  "expand_v": 2,
  "fuse_cross_entropy": true,
  "fuse_linear_cross_entropy": false,
  "fuse_norm": true,
  "fuse_swiglu": true,
  "head_dim": 256,
  "hidden_act": "swish",
  "hidden_ratio": 4,
  "hidden_size": 1024,
  "initializer_range": 0.02,
  "intermediate_size": null,
  "max_position_embeddings": 2048,
  "model_type": "gated_deltanet",
  "norm_eps": 1e-06,
  "num_heads": 6,
  "num_hidden_layers": 21,
  "num_v_heads": null,
  "tie_word_embeddings": false,
  "transformers_version": "4.57.3",
  "use_cache": true,
  "use_gate": true,
  "use_l2warp": false,
  "use_short_conv": true,
  "vocab_size": 32000
}
